export default {
    translation: {
        header: {
            title: 'Профиль',
            home: 'главная',
            works: 'проекты',
            skills: 'навыки',
            about: 'обо мне',
            contacts: 'контакты',
        },
        hero: {
            title: 'Ахмед — <1>web-дизайнер</1> и <1>front-end разработчик</1>',
            description:
                'Создаю цифровые продукты, где визуальный стиль встречается с техническим совершенством',
            button: 'Связаться со мной !',
            status: 'Сейчас работает над <1>Портфолио</1>',
            quote: 'Я не псих, я просто очень, очень хорош в своём деле!',
            author: 'Хоумлендер',
        },
        projects: {
            title: '#<1>проекты</1>',
            viewAll: 'Все проекты',
            labels: {
                checkCode: 'Код',
                live: 'Демо',
            },
            items: {
                infostorm: {
                    description:
                        'Автоматизированный агрегатор новостей с XML-парсингом и фоновым обновлением данных для комфортного чтения без рекламы.',
                },
                weather: {
                    description:
                        'Высокоточная система мониторинга погоды, предоставляющая атмосферные метрики и данные об окружающей среде в реальном времени.',
                },
                necoChat: {
                    description:
                        'Продвинутая платформа для общения с защищенной JWT-авторизацией и сложным управлением стейтом для чата в реальном времени.',
                },
            },
        },
        skills: {
            title: '#<1>навыки</1>',
            warning: 'Содержание кофе низкое (15%).',
            critical:
                'Уровень энергии ниже порогового значения. \n' +
                'Производительность системы снижена.',
            status: 'онлайн и мотивированный',
        },
        about: {
            title: '#<1>обо мне</1>',
            greeting: 'Привет, Меня зовут Ахмед!',
            paragraphs: {
                first: `
                    Я фронтенд-разработчик из Москвы с фокусом на React и TypeScript.
                    Моя специализация создание сложных веб-сервисов,
                    которые решают реальные бизнес-задачи: от автоматизации ритейла до интернет-магазинов и личных кабинетов.
                `,
                second: `
                    Я не просто выполняю задачи — я участвую в проектировании решений,
                    помогаю коллегам на код-ревью и всегда ищу способы сделать процесс
                    разработки эффективнее. Сейчас ищу продуктовую команду,
                    где смогу применить свой опыт для создания действительно полезных и надежных продуктов.
                `,
            },
            button: 'Читать Далее',
        },
        contacts: {
            title: '#<1>Контакты</1>',
            text:
                'Давайте работать вместе! Я всегда открыт для новых возможностей, индивидуальных проектов и творческого сотрудничества.\n' +
                'Давайте вместе создадим что-нибудь великое!',
            messages: 'Напишите мне здесь',
        },
        notFound: {
            title: '404: Объект в работе',
            description:
                'Эта страница не брошена на произвол судьбы!\nОна просто находится в состоянии ',
            highlight: '"вечной доработки"',
            subtext: 'Работа кипит, страница жива, просто дайте мне еще пару чашек эспрессо.',
            backButton: 'Домой, к стабильности',
            retryButton: 'Проверить еще раз (вдруг доделал)',
        },
    },
}
